const h_jrny_tp_cd = {
  10: "열차상품",
  11: "편도",
  12: "왕편",
  13: "복편",
  14: "환승편도",
  15: "왕편환승",
  16: "복편환승",
  20: "병합",
  21: "병합선행",
  22: "병합후행",
  50: "열차외상품",
  51: "숙박",
  52: "렌터카",
  53: "선박",
  54: "이벤트",
  55: "항공"
};

const h_psg_tp_cd = {
  1: "어른",
  2: "unknown",
  3: "어린이"
};

const h_psrm_cl_cd = {
  1: "일반실",
  2: "특실",
  3: "침대실",
  4: "가족실",
  5: "별실",
  6: "비승용",
  7: "우등실"
};

const h_rsv_tp_cd = {
  0: "unknown",
  1: "특단",
  2: "전세",
  3: "일반",
  4: "대납",
  5: "Open",
  6: "T-Less",
  7: "OVER",
  8: "대기",
  9: "단체",
  10: "열전",
  11: "군수송",
  12: "우편배송"
};

const h_seat_att_cd_2 = {
  9: "순방",
  10: "역방"
};

const h_seat_att_cd_3 = {
  11: "1인",
  12: "창측",
  13: "내측"
};

const h_trn_clsf_cd = {
  "00": "KTX, KTX-산천",
  "01": "새마을호",
  "02": "무궁화호",
  "03": "통근열차",
  "04": "누리로",
  "05": "전체",
  "06": "공항직통",
  "KTX-07": "KTX-산천",
  "ITX-08": "ITX-새마을",
  "ITX-09": "ITX-청춘"
};

export {
  h_jrny_tp_cd,
  h_psg_tp_cd,
  h_psrm_cl_cd,
  h_rsv_tp_cd,
  h_seat_att_cd_2,
  h_seat_att_cd_3,
  h_trn_clsf_cd
};
